#pragma once

// pch.h: Ёто файл предкомпилированного заголовка.
// ѕеречисленные ниже файлы компилируютс€ только один раз, что ускор€ет последующие сборки.
// Ёто также вли€ет на работу IntelliSense, включа€ многие функции, св€занные с завершением кода и переходами.
// ќднако изменение любого из приведенных здесь файлов между операци€ми сборки приведет к повторной компил€ции всех(!) этих файлов.
// Ќе добавл€йте сюда файлы, которые планируетс€ часто измен€ть, так как в этом случае выигрыша в производительности не будет.

#ifndef PCH_H
#define PCH_H

// ƒобавл€йте сюда заголовочные файлы дл€ предварительной компил€ции
#include <windows.h>
#include <string>
#include <vector>

#endif // PCH_H