#pragma once

// pch.h: Это файл предкомпилированного заголовка.
// Перечисленные ниже файлы компилируются только один раз, что ускоряет последующие сборки.
// Это также влияет на работу IntelliSense, включая многие функции, связанные с завершением кода и переходами.
// Однако изменение любого из приведенных здесь файлов между операциями сборки приведет к повторной компиляции всех(!) этих файлов.
// Не добавляйте сюда файлы, которые планируется часто изменять, так как в этом случае выигрыша в производительности не будет.

#ifndef PCH_H
#define PCH_H

#include <windows.h>
#include <string>
#include <vector>
#include <zip.h>

#endif // PCH_H